Revit 2020 API
Metal Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Metal
Visual Basic
Public NotInheritable Class Metal
Visual C++
public ref class Metal abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Metal
See Also
Metal Members
Autodesk.Revit.DB.Visual Namespace